# AssetPropertyReference Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyReference Class
Members See Also
---
Represents a connected property of material.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class AssetPropertyReference : AssetProperty
```

Visual Basic
---
```text
Public Class AssetPropertyReference _
	Inherits AssetProperty
```

Visual C++
---
```text
public ref class AssetPropertyReference : public AssetProperty
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Visual..::..AssetProperty Autodesk.Revit.DB.Visual..::..AssetPropertyReference
# See Also
AssetPropertyReference Members
Autodesk.Revit.DB.Visual Namespace